---
kind: method
id: M:Autodesk.Revit.DB.Structure.CodeCheckingParameterServiceData.Dispose
source: html/cbd1ee6e-fbb5-cafe-220e-7778c83575ae.htm
---
# Autodesk.Revit.DB.Structure.CodeCheckingParameterServiceData.Dispose Method

Releases all resources used by the CodeCheckingParameterServiceData

## Syntax (C#)
```csharp
public void Dispose()
```